################################################################################
#
#   MessageResources_ja.properties
#
#   It is a property that handles the message. (Japanese)
#   I have to define the message to be output to the log and the message area.
#
#   $ MessageResources_ja.properties 2605 2016-09-08 02:24:44Z 10088DS00879 $
#
################################################################################

# Common Application Development Infrastructure (generic)
com.globaldenso.ai.core.LOG_MESSAGE_TEMPLATE=ID:{0} \u30b3\u30fc\u30c9:{1} \u30e1\u30c3\u30bb\u30fc\u30b8:{2} \u767a\u751f\u65e5\u6642:{3}
com.globaldenso.ai.core.UNDEFINED_CODE=\u30b3\u30fc\u30c9\u304c\u672a\u5b9a\u7fa9\u3067\u3059\u3002\u30b3\u30fc\u30c9\u3092\u5b9a\u7fa9\u3057\u3066\u4e0b\u3055\u3044\u3002\u30b3\u30fc\u30c9:{0}
com.globaldenso.ai.core.UNDEFINED_ERROR_CODE=\u30a8\u30e9\u30fc\u30b3\u30fc\u30c9\u304c\u672a\u5b9a\u7fa9\u3067\u3059\u3002\u30a8\u30e9\u30fc\u30b3\u30fc\u30c9\u3092\u5b9a\u7fa9\u3057\u3066\u4e0b\u3055\u3044\u3002\u4f8b\u5916\u30bf\u30a4\u30d7:{0}\u3001\u30e1\u30c3\u30bb\u30fc\u30b8:{1}
com.globaldenso.ai.core.UNKNOWN_ERROR_CODE=\u30d5\u30ec\u30fc\u30e0\u30ef\u30fc\u30af\u5916\u3067\u4f8b\u5916\u304c\u767a\u751f\u3057\u3066\u3044\u307e\u3059\u3002

# Common Application Development Infrastructure (system error)
AI-90-0000=[AI-90-0000]\u4e88\u671f\u305b\u306c\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u4f8b\u5916\u30bf\u30a4\u30d7:{0}\u3001\u30e1\u30c3\u30bb\u30fc\u30b8:{1}
AI-90-0001=[AI-90-0001]\u30d7\u30ec\u30bc\u30f3\u30c6\u30fc\u30b7\u30e7\u30f3\u5c64\u3067\u4e88\u671f\u305b\u306c\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u4f8b\u5916\u30bf\u30a4\u30d7:{0}\u3001\u30e1\u30c3\u30bb\u30fc\u30b8:{1}
AI-90-0002=[AI-90-0002]\u30d3\u30b8\u30cd\u30b9\u5c64\u3067\u4e88\u671f\u305b\u306c\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u4f8b\u5916\u30bf\u30a4\u30d7:{0}\u3001\u30e1\u30c3\u30bb\u30fc\u30b8:{1}
AI-90-0003=[AI-90-0003]\u30a4\u30f3\u30c6\u30b0\u30ec\u30fc\u30b7\u30e7\u30f3\u5c64\u3067\u4e88\u671f\u305b\u306c\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u4f8b\u5916\u30bf\u30a4\u30d7:{0}\u3001\u30e1\u30c3\u30bb\u30fc\u30b8:{1}
AI-90-0004=[AI-90-0004]DB\u30b3\u30cd\u30af\u30b7\u30e7\u30f3\u3067\u4e88\u671f\u305b\u306c\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002\u4f8b\u5916\u30bf\u30a4\u30d7:{0}\u3001\u30e1\u30c3\u30bb\u30fc\u30b8:{1}
AI-90-0005=[AI-90-0005]error.jsp\u8868\u793a\u6642\u306b\u3001\u4e88\u671f\u305b\u306c\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
AI-90-0006=[AI-90-0006]\u4e0d\u6b63\u306a\u64cd\u4f5c\u304c\u884c\u308f\u308c\u307e\u3057\u305f\u3002
AI-90-0007=[AI-90-0007]\u578b\u5909\u63db\u30fb\u30d0\u30ea\u30c7\u30fc\u30b7\u30e7\u30f3\u30a8\u30e9\u30fc\u30fb\u30a2\u30d7\u30ea\u30b1\u30fc\u30b7\u30e7\u30f3\u4f8b\u5916\u767a\u751f\u6642\u306e\u9077\u79fb\u5148\u304c\u8a2d\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
AI-90-0008=[AI-90-0008]\u623b\u308a\u5024\u306b\u30d3\u30e5\u30fc\u540d\u304c\u306a\u3044\u30cf\u30f3\u30c9\u30e9\u30e1\u30bd\u30c3\u30c9\u306e\u305f\u3081ErrorBack\u306e\u9077\u79fb\u5148\u306b\u9077\u79fb\u3067\u304d\u307e\u305b\u3093\u3002
AI-80-0000=[AI-80-0000]JDBC\u64cd\u4f5c\u4e2d\u306b\u4e88\u671f\u305b\u306c\u4f8b\u5916\u304c\u767a\u751f\u3057\u307e\u3057\u305f\u3002
AI-80-0001=[AI-80-0001]\u4e0d\u6b63\u306aSQL\u3092\u767a\u884c\u3057\u307e\u3057\u305f\u3002
AI-80-0002=[AI-80-0002]\u4e0d\u6b63\u306a\u64cd\u4f5c\u304c\u884c\u308f\u308c\u307e\u3057\u305f\u3002
AI-80-0003=[AI-80-0003]\u30c7\u30fc\u30bf\u30d9\u30fc\u30b9\u30b3\u30cd\u30af\u30b7\u30e7\u30f3\u306e\u78ba\u7acb\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
AI-80-0004=[AI-80-0004]\u30c7\u30fc\u30bf\u30a2\u30af\u30bb\u30b9\u306e\u6a29\u9650\u304c\u3042\u308a\u307e\u305b\u3093\u3002
AI-80-0005=[AI-80-0005]\u30c7\u30fc\u30bf\u306b\u4e0d\u6574\u5408\u304c\u3042\u308a\u307e\u3059\u3002
AI-80-0006=[AI-80-0006]\u30ed\u30c3\u30af\u304c\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3002
AI-80-0007=[AI-80-0007]\u30c8\u30e9\u30f3\u30b6\u30af\u30b7\u30e7\u30f3\u304c\u30b7\u30ea\u30a2\u30eb\u5316\u3067\u304d\u307e\u305b\u3093\u3002
AI-80-0008=[AI-80-0008]\u30c7\u30c3\u30c9\u30ed\u30c3\u30af\u304c\u691c\u51fa\u3055\u308c\u307e\u3057\u305f\u3002
AI-80-0009=[AI-80-0009]\u4e00\u610f\u5236\u7d04\u9055\u53cd\u3067\u3059\u3002

# Mail sending function (mailsend)
AI-E0-ML00=[AI-E0-ML00]\u30e1\u30fc\u30eb\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30d5\u30a1\u30a4\u30eb\u540d:{0} \u30ed\u30b1\u30fc\u30eb:{1}
AI-E0-ML01=[AI-E0-ML01]\u30e1\u30fc\u30eb\u30d5\u30a9\u30fc\u30de\u30c3\u30c8\u30d5\u30a1\u30a4\u30eb\u5185\u306e{0}\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
AI-E0-ML02=[AI-E0-ML02]\u30e1\u30fc\u30eb\u9001\u4fe1\u8a2d\u5b9a\u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30d5\u30a1\u30a4\u30eb\u540d:{0}
AI-E0-ML03=[AI-E0-ML03]\u30e1\u30fc\u30eb\u9001\u4fe1\u8a2d\u5b9a\u30d5\u30a1\u30a4\u30eb\u5185\u306e{0}\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
AI-E0-ML04=[AI-E0-ML04]\u30e1\u30fc\u30eb\u9001\u4fe1\u8a2d\u5b9a\u30d5\u30a1\u30a4\u30eb\u5185\u306e{0}\u306f{1}\u3067\u6307\u5b9a\u3057\u3066\u304f\u3060\u3055\u3044\u3002
AI-E0-ML05=[AI-E0-ML05]{0}\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
AI-E0-ML06=[AI-E0-ML06]\u9001\u4fe1\u5148\u30e1\u30fc\u30eb\u30a2\u30c9\u30ec\u30b9(To,Cc,Bcc)\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
AI-E0-ML07=[AI-E0-ML07]\u6307\u5b9a\u3055\u308c\u305f\u6dfb\u4ed8\u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002\u30d5\u30a1\u30a4\u30eb\u540d:{0}
AI-E0-ML08=[AI-E0-ML08]\u6dfb\u4ed8\u30d5\u30a1\u30a4\u30eb\u30c7\u30fc\u30bf\u30bd\u30fc\u30b9\u306e\u4f5c\u6210\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
AI-E0-ML09=[AI-E0-ML09]\u30e1\u30fc\u30eb\u306e\u9001\u4fe1\u306b\u5931\u6557\u3057\u307e\u3057\u305f\u3002
AI-E0-ML10=[AI-E0-ML10]\u6307\u5b9a\u3055\u308c\u305f\u30a8\u30f3\u30b3\u30fc\u30c9\u30bf\u30a4\u30d7\u306f\u5229\u7528\u3067\u304d\u307e\u305b\u3093\u3002\u30bf\u30a4\u30d7:{0}
AI-E0-ML11=[AI-E0-ML11]\u6539\u884c\u30b3\u30fc\u30c9\u3092\u542b\u3080\u30bf\u30a4\u30c8\u30eb\u306f\u5229\u7528\u3067\u304d\u307e\u305b\u3093\u3002

# OS command execution (executecommand)
AI-E0-EC00=[AI-E0-EC00]\u5b9f\u884c\u30d5\u30a1\u30a4\u30eb\u304c\u6307\u5b9a\u3055\u308c\u3066\u3044\u307e\u305b\u3093\u3002
AI-E0-EC01=[AI-E0-EC01]\u6307\u5b9a\u3055\u308c\u305f\u5b9f\u884c\u30d5\u30a1\u30a4\u30eb\u304c\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3002
AI-E0-EC02=[AI-E0-EC02]\u5b9f\u884c\u30d5\u30a1\u30a4\u30eb\u306e\u5f15\u6570\u306bnull\u304c\u6307\u5b9a\u3055\u308c\u307e\u3057\u305f\u3002

# File size check (client side)
AI-E0-FS00=[AI-E0-FS00]\u30b5\u30a4\u30ba\u304c{0}byte\u3092\u8d85\u3048\u308b\u30d5\u30a1\u30a4\u30eb\u3092\u30a2\u30c3\u30d7\u30ed\u30fc\u30c9\u3059\u308b\u3053\u3068\u306f\u3067\u304d\u307e\u305b\u3093\u3002

# CSV <=> List Conversion
AI-E0-CL01=[AI-E0-CL01]\u30d7\u30ed\u30d1\u30c6\u30a3\u304c\u53d6\u5f97\u3067\u304d\u307e\u305b\u3093\u3067\u3057\u305f\u3002 \u30d7\u30ed\u30d1\u30c6\u30a3\u30d5\u30a1\u30a4\u30eb\u540d:{0}.properties, \u30ad\u30fc:{1}
AI-E0-CL02=[AI-E0-CL02]{0}.properties \u306b\u5b9a\u7fa9\u3055\u308c\u305f\u6539\u884c\u30b3\u30fc\u30c9\u306f\u5229\u7528\u3067\u304d\u307e\u305b\u3093\u3002
AI-E0-CL03=[AI-E0-CL03]\u5f15\u6570\u304c\u4e0d\u6b63\u306a\u5f62\u5f0f\u3067\u3059\u3002CSV\u5f62\u5f0f\u306e\u6587\u5b57\u5217\u3092\u30bb\u30c3\u30c8\u3057\u3066\u304f\u3060\u3055\u3044\u3002

# Fiscal Year
AI-E0-FY01=[AI-E0-FY01]\u5165\u529b\u30c7\u30fc\u30bf\u304cNULL\u3067\u3059\u3002

# File Absolute Path
AI-E0-FP01=[AI-E0-FP01]\u5f15\u6570\u304c\u7a7a\u3067\u3059\u3002
AI-E0-FP02=[AI-E0-FP02]\u6307\u5b9a\u3055\u308c\u305f\u5f15\u6570\u306b\u30de\u30c3\u30c1\u3059\u308b\u30d5\u30a1\u30a4\u30eb\u306f\u898b\u3064\u304b\u308a\u307e\u305b\u3093\u3067\u3057\u305f\u3002

# ------------------------------------------------------------------------------
# Please add the following if you want to add a message in the application
# ------------------------------------------------------------------------------

